#                                                                             #
# Brewfile                                                                    #
# ------------                                                                #
# Author: @MultifokalHirn                                                     #
# Repository: https://github.com/MultifokalHirn/.dotfiles                     #
#                                                                             #
# This Brewfile contains a list of Homebrew packages to be installed          #
# Usage: brew bundle --file=~/Brewfile-MultifokalHirn                         #
#                                                                             #

#                                                                             #
# Packages I want to check out                                                #
# ----------------------------                                               #
# brew "dui"
# brew "nushell"
# brew "presenterm"
# brew "shellcheck"                         # Static analysis and lint tool, for (ba)sh scripts
# brew "starship.rs"
# brew "tabby-agent"
# brew "tig"                                # Text interface for Git repositories  https://jonas.github.io/tig/
# brew "zplug"                              # plugin manager for zsh
# brew "zsh-abbr"           # https://github.com/olets/zsh-abbr
# brew "zsh-async"                  # https://github.com/mafredri/zsh-async
# cask "karabiner-elements"                 # Keyboard customizer
# cask "stats"                   # macOS system monitor in your menu bar (like iStat menus) https://github.com/exelban/stats
# cask "syntax-highlight"                    # Quicklook extension for source files
brew "charmbracelet/tap/freeze" # screenshot a command https://github.com/charmbracelet/freeze
brew "fd"                       # Simple, fast and user-friendly alternative to find. https://github.com/sharkdp/fd
brew "midnight-commander"       # visual file manager https://midnight-commander.org
brew "ripgrep-all"              # Wrapper around ripgrep that adds multiple rich file types
brew "yazi"
tap "charmbracelet/tap"

#                                                                             #
# PACKAGES
# ----------------------------                                                #

# brew "clx"                                # Hacker News browser in the terminal [DEPRECATED]
# brew "glances"                            # System monitoring tool
# brew "helix"                              # code editor
# brew "muesli/homebrew-tap/duf"            # Disk Usage/Free Utility
# brew "nvm"                                # Node Version Manager
# brew "olets/tap/zsh-window-title" # DEPRECATED ?
# brew "openssh"                            # OpenSSH client and server
# brew "screen"
brew "asciinema"                    # Terminal session recorder
brew "bash-completion2"             # Bash completion
brew "bash"                         # Bash shell
brew "bat"                          # Cat clone with syntax highlighting
brew "bottom"                       # Cross-platform graphical process/system monitor
brew "broot"                        # File manager and launcher for the command-line
brew "chafa"                        # Image-to-text converter
brew "dust"                         # alternative to du (disk utility)
brew "eza"                          # maintained modern replacement for 'ls' (predecessor exa is not maintained)
brew "fortune"                      # Display random quotes
brew "fzf"                          # Command-line fuzzy finder
brew "gh"                           # GitHub CLI tool
brew "git-delta"                    # Syntax-highlighting pager for Git
brew "git-extras"                   # Additional Git commands
brew "git"                          # Distributed version control system
brew "gnupg"                        # GNU Privacy Guard
brew "grep"                         # Text search tool
brew "hr"                           # Horizontal rule for terminal output
brew "htop"                         # Interactive process viewer
brew "jq"                           # Lightweight and flexible command-line JSON processor
brew "lazydocker"                   # Terminal UI for Docker and Docker Compose
brew "less"                         # Pager program similar to more
brew "lesspipe"                     # Preprocessor for less
brew "mkcert"                       # Simple tool to make locally trusted development certificates
brew "nano"                         # Text editor
brew "nanorc"                       # Syntax highlighting for nano
brew "nmap"                         # Network exploration tool and security scanner
brew "nvm"                          # Manage multiple Node.js versions
brew "pandoc"                       # Universal document converter
brew "pipx"                         # Python package executer
brew "pre-commit"                   # Framework for managing and maintaining multi-language pre-commit hooks
brew "pyenv"                        # Python version management
brew "python-argcomplete"           # Python package 'argcomplete'
brew "rclone"                       # Command-line program to sync files and directories to and from cloud storage
brew "rg"                           # ripgrep, a faster grep
brew "rsync"                        # Fast and versatile file copying/syncing program
brew "selecta"                      # Fuzzy text selector for files and anything else you need to select
brew "sqlite"                       # Command-line interface for SQLite
brew "squashfs"                     # Compressed read-only file system
brew "tailscale"                    # Tailscale VPN
brew "tlrc"                         # Simplified and community-driven man pages
brew "tmux"                         # Terminal multiplexer
brew "trash"                        # (?)
brew "tree"                         # Display directories as trees
brew "wget"                         # Internet file retriever
brew "xh"                           # Friendly and fast tool for sending HTTP requests. https://github.com/ducaale/xh
brew "zoxide"                       # Shell extension to navigate your filesystem faster
brew "zsh-autocomplete"             # Additional completion definitions for zsh
brew "zsh-autopair"                 # Auto-close and delete matching delimiters in zsh
brew "zsh-autosuggestions"          # zsh plugin that suggests commands as you type
brew "zsh-completions"              # Additional completion definitions for zsh
brew "zsh-fast-syntax-highlighting" # syntax highlighting for zsh
brew "zsh-git-prompt"               # Informative git prompt for zsh https://github.com/olivierverdier/zsh-git-prompt
brew "zsh-history-substring-search" # zsh port of Fish shell's history search
brew "zsh-you-should-use"           # zsh plugin that reminds you to use existing aliases for commands you just typed
brew "zsh"                          # zsh shell

#                                                                             #
# CASKS                                                                       #
# -----                                                                       #

# cask "anki"                   # Memory training application
# cask "calibre"                # E-book management software
# cask "browserosaurus"         # macOS browser chooser
cask "firefox"                # Web browser
# cask "git-credential-manager" # Git Credential Manager for macOS
# cask "github"                 # GitHub Desktop client
# cask "google-chrome"          # Web browser
# cask "kitty"                  # Terminal emulator
# cask "plugdata"               # music synthesis software
# cask "plugdata"               # music synthesis software
cask "keyboard-cowboy"        # Keyboard shortcut utility
# cask "postman"                # Postman
# cask "raycast"                # shortcuts etc
# cask "telegram"               # Messaging app
# cask "visual-studio-code"     # Source code editor
# cask "vlc"                    # Media player
cask "alt-tab"                      # window switching with previews
cask "basictex"                     # Minimal TeX Live distribution for macOS (for pandoc)
cask "chaychoong/tap/font-opus-one" # Opus One font
cask "finicky"                      # app for customizing which browser to start
cask "font-0xproto-nerd-font"
cask "font-arimo-nerd-font"
cask "font-departure-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font" # Nerd Font patched version of Hack font
cask "font-martian-mono-nerd-font"
cask "font-martian-mono"
cask "font-monaspace"
cask "font-proggy-clean-tt-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "ghostty"            # Terminal emulator
cask "hammerspoon"        # interact with macOS API in Lua
cask "handbrake"          # Open-source video transcoder
cask "iterm2"             # Terminal emulator for macOS
cask "jordanbaird-ice"    # Hide menu bar icons on macOS; replaced dozer
cask "karabiner-elements" # Keyboard customiser
cask "maccy"              # clipboard manager
cask "macfuse"            # File system integration for macOS (formely 'osxfuse')
cask "ngrok"              # Secure introspectable tunnels to localhost
cask "obsidian"           # obsidian

#                                                                             #
# QUICKLOOK PLUGINS (macOS)                                                   #
# -------------------------                                                   #
# https://github.com/sindresorhus/quick-look-plugins                          #

cask "apparency"          # for inspecting app bundles
cask "qlcolorcode"        # for color-coded files
cask "qlmarkdown"         # for Markdown files
cask "qlstephen"          # for plain text files without file extensions
cask "qlvideo"            # for video files
cask "suspicious-package" # for inspecting macOS installer packages
# brew "quicklook-json"                     # for JSON files [status-unknown]
# brew "quicklookase"                       # for Adobe Swatch Exchange files
# cask "qlimagesize"                        # for image size and resolution
