# This Brewfile contains a list of Homebrew and Cask packages to be installed

# Usage: brew bundle --file=~/Brewfile-MultifokalHirn
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "asciinema" # Terminal session recorder
brew "bash-completion2" # Bash completion
brew "bash" # Bash shell
brew "bat" # Cat clone with syntax highlighting
brew "bottom" # Cross-platform graphical process/system monitor
brew "broot" # File manager and launcher for the command-line
brew "clx" # Hacker News browser in the terminal
brew "eza" # maintained modern replacement for 'ls' (predecessor exa is not maintained)
brew "fortune" # Display random quotes
brew "fzf" # Command-line fuzzy finder
brew "gh" # GitHub CLI tool
brew "git-delta" # Syntax-highlighting pager for Git
brew "git-extras" # Additional Git commands
brew "git" # Distributed version control system
# brew "glances" # System monitoring tool
brew "grep" # Text search tool
brew "gnupg" # GNU Privacy Guard
brew "less" # Pager program similar to more
brew "htop" # Interactive process viewer
brew "jq" # Lightweight and flexible command-line JSON processor
brew "lazydocker" # Terminal UI for Docker and Docker Compose
brew "hr" # Horizontal rule for terminal output
brew "chafa" # Image-to-text converter
brew "squashfs" # Compressed read-only file system
brew "lesspipe" # Preprocessor for less
# brew "muesli/homebrew-tap/duf" # Disk Usage/Free Utility
brew "nano" # Text editor
brew "nanorc" # Syntax highlighting for nano
brew "nmap" # Network exploration tool and security scanner
# brew "nvm" # Node Version Manager
# brew "openssh" # OpenSSH client and server
brew "pandoc" # Universal document converter
brew "pre-commit" # Framework for managing and maintaining multi-language pre-commit hooks
brew "pyenv" # Python version management
brew "pipx" # Python package executer
brew "python-argcomplete" # Python package 'argcomplete'
brew "trash"
# https://github.com/sindresorhus/quick-look-plugins
brew "qlcolorcode" # macOS quicklook plugin for color-coded files
brew "qlstephen" # macOS quicklook plugin for plain text files without file extensions
brew "qlmarkdown" # macOS quicklook plugin for Markdown files
brew "quicklook-json" # macOS quicklook plugin for JSON files
brew "qlimagesize" # macOS quicklook plugin for image size and resolution
brew "suspicious-package" # macOS quicklook plugin for inspecting macOS installer packages
brew "apparency" # macOS quicklook plugin for inspecting app bundles
brew "quicklookase" # macOS quicklook plugin for inspecting Adobe Swatch Exchange files
brew "qlvideo" # macOS quicklook plugin for video files

brew "rclone" # Command-line program to sync files and directories to and from cloud storage
brew "rg" # ripgrep, a faster grep
brew "rsync" # Fast and versatile file copying/syncing program
# brew "screen"
brew "selecta" # Fuzzy text selector for files and anything else you need to select
brew "sqlite" # Command-line interface for SQLite
brew "tldr" # Simplified and community-driven man pages
brew "tmux" # Terminal multiplexer
brew "tree" # Display directories as trees
brew "wget" # Internet file retriever
brew "zsh" # Zsh shell
brew "zsh-completions" # Additional completion definitions for Zsh
brew "helix" # code editor
## Packages I want to checkout

# brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
# brew "tig" # Text interface for Git repositories  https://jonas.github.io/tig/
# brew "zplug" #plugin manager for zsh
# cask "karabiner-elements" # Keyboard customizer
# cask "maccy" # Clipboard manager
# cask "syntax-highlight" # Quicklook extension for source files

## Casks
# cask "ghostty"
# cask "plugdata" # music synthesis software
# cask "font-hack-nerd-font" # Nerd Font patched version of Hack font
# cask "dozer" # Hide menu bar icons on macOS
# cask "kitty"
# cask "firefox" # Web browser
# cask "github" # GitHub Desktop client
# cask "google-chrome" # Web browser
# cask "handbrake" # Open-source video transcoder
# cask "iterm2" # Terminal emulator for macOS
# cask "osxfuse" # File system integration for macOS
# cask "telegram" # Messaging app
# cask "visual-studio-code" # Source code editor
# cask "vlc" # Media player
cask "hammerspoon" # interact with macOS API in Lua

## VS Code extensions

vscode "2gua.rainbow-brackets"
vscode "aaron-bond.better-comments"
vscode "aeschli.vscode-css-formatter"
vscode "alexcvzz.vscode-sqlite"
vscode "analytic-signal.preview-html"
vscode "be5invis.toml"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.emojisense"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "csstools.postcss"
vscode "CT6502.idl"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "DigitalAssetHoldingsLLC.ghcide"
vscode "docsmsft.docs-yaml"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.docker-explorer"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "garreh.sublime-search-vscode"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "ginfuru.vscode-jekyll-snippets"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.heygithub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
# vscode "Gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "hoovercj.haskell-linter"
vscode "hoovercj.ruby-linter"
vscode "houssaineamzil.next-js-snippets"
vscode "huizhou.githd"
# vscode "James-Yu.latex-workshop"
vscode "jamesohortle.unicodehover"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "justusadam.language-haskell"
vscode "kargware.vscode-extension-jekyll-kw"
vscode "KevinRose.vsc-python-indent"
vscode "kortina.vscode-markdown-notes"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "lextudio.restructuredtext"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mathematic.vscode-latex"
vscode "mattn.Lisp"
vscode "MaxGabriel.brittany"
vscode "miguelsolorio.fluent-icons"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.Theme-TomorrowKit"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msyrus.go-doc"
vscode "naumovs.color-highlight"
vscode "ndmitchell.haskell-ghcid"
vscode "nickfode.latex-formatter"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "NuclleaR.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "oven.bun-vscode"
vscode "PascalReitermann93.vscode-yaml-sort"
vscode "philipbe.theme-gray-matter"
vscode "pomdtr.excalidraw-editor"
vscode "pranaygp.vscode-css-peek"
vscode "qingpeng.common-lisp"
vscode "qwtel.sqlite-viewer"
vscode "redhat.ansible"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "samuelcolvin.jinjahtml"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "SirTori.indenticator"
vscode "sissel.shopify-liquid"
vscode "sozercan.slack"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "TabNine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "tchayen.markdown-links"
vscode "trond-snekvik.simple-rst"
vscode "tushortz.python-extended-snippets"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "waderyan.gitblame"
vscode "WakaTime.vscode-wakatime"
vscode "WallabyJs.console-ninja"
vscode "yidash.outline-plus"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
vscode "Zignd.html-css-class-completion"

